app/views/admins/show.html.erb

<h3>My Posts</h3>
<% @admin.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."admin_id" = 1 LIMIT 1