app/controllers/admins_controller.rb

  def show
    @admin = Admin.find(params[:id])
    @posts = Post.find_all_by_admin_id(@admin.id)
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."admin_id" = 1 LIMIT 1

  def create
    @admin = Admin.new(params[:admin])

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)