app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("author", "content", "created_at", "post_id", "priority", "updated_at", "votes") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def comment
    set_cors_headers
    if @post = Post.find(params[:id])
      @author = params[:author].to_s
      @content = params[:content].to_s
      @comment = @post.comments.create(author: @author, content: @content, votes: 0)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
  def retrieve
    set_cors_headers
    if @post = Post.find(params[:id])
      @comments = @post.comments.all.sort_by(&:votes).reverse

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "comments" SET "votes" = 1, "updated_at" = '2012-10-28 17:01:37.710589' WHERE "comments"."id" = 3
---
  def vote
    set_cors_headers
    if @post = Post.find(params[:id])
      if @comment = Comment.find(params[:comment_id].to_i)
        @comment_votes = @comment.votes + 1
        @comment.update_attributes(votes: @comment_votes)

INSERT INTO "posts" ("admin_id", "created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["admin_id", 3], ["created_at", Sun, 28 Oct 2012 02:38:36 UTC +00:00], ["name", "Test Post"], ["updated_at", Sun, 28 Oct 2012 02:38:36 UTC +00:00], ["url", "www.test.com"]]
---
  def create
    @post = current_admin.posts.create(params[:post])