app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by_email(params[:session][:email].downcase)
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'mmiyachi@mit.edu' LIMIT 1